<!DOCTYPE html><html lang="zh-CN" data-theme="light"><head><meta charset="UTF-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"><title>C++：内存模型 | BoomBac's Blog</title><meta name="keywords" content="c++"><meta name="author" content="BoomBac"><meta name="copyright" content="BoomBac"><meta name="format-detection" content="telephone=no"><meta name="theme-color" content="#ffffff"><meta name="description" content="一. 内存模型程序在运行时，OS为该进程分配一块内存，具有以下结构：    注：底部为高地址   文本&#x2F;代码段：保存执行指令，通常可共享，只会有一个副本。 数据段 初始化数据段：存储未初始化的全局和静态变量，此段可读可写 未初始化数据：常被称作 BSS segment，由内核在程序执行前初始化为0，其位于初始化数据段的后方。   栈：临时变量以及虚指针，在栈中分配变量，地址会依次递减，向">
<meta property="og:type" content="article">
<meta property="og:title" content="C++：内存模型">
<meta property="og:url" content="http://example.com/2022/02/25/Cpp%E5%86%85%E5%AD%98%E6%A8%A1%E5%9E%8B/index.html">
<meta property="og:site_name" content="BoomBac&#39;s Blog">
<meta property="og:description" content="一. 内存模型程序在运行时，OS为该进程分配一块内存，具有以下结构：    注：底部为高地址   文本&#x2F;代码段：保存执行指令，通常可共享，只会有一个副本。 数据段 初始化数据段：存储未初始化的全局和静态变量，此段可读可写 未初始化数据：常被称作 BSS segment，由内核在程序执行前初始化为0，其位于初始化数据段的后方。   栈：临时变量以及虚指针，在栈中分配变量，地址会依次递减，向">
<meta property="og:locale" content="zh_CN">
<meta property="og:image" content="https://boombac-note-images.oss-cn-hangzhou.aliyuncs.com/blog/img/cpp_cover.png">
<meta property="article:published_time" content="2022-02-25T09:54:07.000Z">

<h1 id="二-类的内存分布"><a href="#二-类的内存分布" class="headerlink" title="二. 类的内存分布"></a>二. 类的内存分布</h1><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Shape</span> </span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">float</span> area;</span><br><span class="line">    <span class="type">float</span> perimeter;</span><br><span class="line">    <span class="type">static</span> <span class="type">double</span> PI;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="built_in">Shape</span>();</span><br><span class="line">    ~<span class="built_in">Shape</span>();</span><br><span class="line">    <span class="function"><span class="type">static</span> <span class="type">double</span> <span class="title">GetPI</span><span class="params">()</span></span>;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">float</span> <span class="title">GetArea</span><span class="params">(<span class="type">float</span> side)</span></span>;</span><br><span class="line">    <span class="function"><span class="type">float</span> <span class="title">GetPerimeter</span><span class="params">(<span class="type">float</span> side)</span></span>;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<ul>
<li>Stack: <code>area,perimeter,_vfptr</code></li>
<li>TextSeg:<code>Shape(),~Shape(),GetArea(),GetPerimeter(),static Shape::GetPI</code></li>
<li>DataSeg：<code>static Shape::PI</code></li>
</ul>
<p>总结：</p>
<ul>
<li>函数无论静态与否，都放在文本段</li>
<li>普通变量放在栈，静态变量放在数据段</li>
<li>虚指针在栈中</li>
</ul>
<h1 id="三-对象模型"><a href="#三-对象模型" class="headerlink" title="三. 对象模型"></a>三. 对象模型</h1><blockquote>
<p>vs查看对象布局：</p>
<p>项目属性-&gt;C&#x2F;C++-&gt;命令行<code>/d1 reportSingleClassLayout[class_name]</code>，设置完之后就会在每次编译完成在输出窗口打印布局</p>
</blockquote>
<p>最核心的便是{ % label 虚表指针 + 数据成员 + 内存对齐 pink %}</p>
<blockquote>
<p>说一下<strong>内存对齐：</strong></p>
<p>CPU访存拥有一个细粒度，如果一个数据在一个细粒度的两侧，那么CPU额外需要访问两次，并对得到的数据进行删减拼接，就会产生性能的浪费。</p>
<p>内存对齐有以下几个规则：</p>
<ul>
<li><code>class/struct</code>的对齐值由其最大的成员决定。可以通过<code>alignof</code>关键字查看</li>
<li>可以给编译器指定一个最大的对齐值，g++下：<code>#pragma pack(n)</code></li>
<li>实际对齐由上面两个中最小的决定</li>
<li>空类&#x2F;结构体大小为1：编译器添加的char，使其对象不同实体具有独特的地址</li>
</ul>
</blockquote>
<h2 id="成员数据"><a href="#成员数据" class="headerlink" title="成员数据"></a>成员数据</h2><h3 id="单继承"><a href="#单继承" class="headerlink" title="单继承"></a>单继承</h3><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Test</span></span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> Test_a_;</span><br><span class="line">    <span class="type">char</span> Test_c_;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Unit1</span> : <span class="keyword">public</span> Test</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> Unit1_a_;</span><br><span class="line">    <span class="type">char</span> Unit1_c_;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Unit1	size(16):</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt; 0	| +--- (base class Test)</span><br><span class="line">1&gt; 0	| | Test_a_</span><br><span class="line">1&gt; 4	| | Test_c_</span><br><span class="line">1&gt;  	| | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt; 8	| Unit1_a_</span><br><span class="line">1&gt;12	| Unit1_c_</span><br><span class="line">1&gt;  	| &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;	+---</span><br></pre></td></tr></table></figure>

<p>在单继承下，子类只是将一个父类的副本放在自己内存的首部（低地址-&gt;高地址）。<code>char</code>将其填充为4byte</p>
<h3 id="多继承"><a href="#多继承" class="headerlink" title="多继承"></a>多继承</h3><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedA</span> : <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_A_;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedB</span> : <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_B_;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedC</span> : <span class="keyword">public</span> DerivedA,<span class="keyword">public</span> DerivedB</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_C_;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class DerivedC	size(12):</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt; 0	| +--- (base class DerivedA)</span><br><span class="line">1&gt; 0	| | derived_A_</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt; 4	| +--- (base class DerivedB)</span><br><span class="line">1&gt; 4	| | derived_B_</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt; 8	| derived_C_</span><br><span class="line">1&gt;	+---</span><br></pre></td></tr></table></figure>

<p>和单继承情况类似，使用非虚多继承时，将两个父类副本按照继承的顺序放置在内存首部。</p>
<h3 id="菱形继承"><a href="#菱形继承" class="headerlink" title="菱形继承"></a>菱形继承</h3><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span>  <span class="title class_">Base</span></span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> base_;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedA</span> : <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_A_;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedB</span> : <span class="keyword">public</span> Base</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_B_;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedC</span> : <span class="keyword">public</span> DerivedA, <span class="keyword">public</span> DerivedB</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_C_;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class DerivedC	size(20):</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt; 0	| +--- (base class DerivedA)</span><br><span class="line">1&gt; 0	| | +--- (base class Base)</span><br><span class="line">1&gt; 0	| | | base_</span><br><span class="line">1&gt;	| | +---</span><br><span class="line">1&gt; 4	| | derived_A_</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt; 8	| +--- (base class DerivedB)</span><br><span class="line">1&gt; 8	| | +--- (base class Base)</span><br><span class="line">1&gt; 8	| | | base_</span><br><span class="line">1&gt;	| | +---</span><br><span class="line">1&gt;12	| | derived_B_</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt;16	| derived_C_</span><br><span class="line">1&gt;	+---</span><br></pre></td></tr></table></figure>

<p>在这种情况下，A和B中都保存着来自Base的副本，访问时会产生二义性。下面使用虚继承来避免这种情况。将A和B共同的基类改用<code>virtual public Base</code>，此时布局便复杂了起来：</p>
<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br></pre></td><td class="code"><pre><span class="line">1&gt;main.cpp</span><br><span class="line">1&gt;class DerivedC	size(44):</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt; 0	| +--- (base class DerivedA)</span><br><span class="line">1&gt; 0	| | &#123;vbptr&#125;</span><br><span class="line">1&gt; 8	| | derived_A_</span><br><span class="line">1&gt;  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">1&gt;  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt;16	| +--- (base class DerivedB)</span><br><span class="line">1&gt;16	| | &#123;vbptr&#125;</span><br><span class="line">1&gt;24	| | derived_B_</span><br><span class="line">1&gt;  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">1&gt;  	| | &lt;alignment member&gt; (size=4)</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt;32	| derived_C_</span><br><span class="line">1&gt;  	| &lt;alignment member&gt; (size=4)</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt;	+--- (virtual base Base)</span><br><span class="line">1&gt;40	| base_</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt;DerivedC::$vbtable@DerivedA@:</span><br><span class="line">1&gt; 0	| 0</span><br><span class="line">1&gt; 1	| 40 (DerivedCd(DerivedA+0)Base)</span><br><span class="line">1&gt;DerivedC::$vbtable@DerivedB@:</span><br><span class="line">1&gt; 0	| 0</span><br><span class="line">1&gt; 1	| 24 (DerivedCd(DerivedB+0)Base)</span><br><span class="line">1&gt;vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">1&gt;            Base      40       0       4 0</span><br></pre></td></tr></table></figure>

<p>编译器为每个直接基类都添加了一个<code>vbptr</code>（虚基类表），直接基类依旧按照固有顺序，虚基类则沉底。以<code>DerivedA</code>的虚表为例，此时一共有两项：</p>
<ol>
<li><code>DerivedA</code>对象指针和其<code>vbptr</code>之间的偏移</li>
<li>虚基类<code>Base</code>对象指针和<code>DerivedA</code>的<code>vbptr</code>之间的偏移。此处为40</li>
</ol>
<hr>
<p>总结以下：</p>
<ul>
<li>首先排列非虚继承的基类实例</li>
<li>有虚基类时，为每一个基类添加一个<code>vbptr</code></li>
<li>排列派生类数据成员</li>
<li>在最后放置基类成员</li>
</ul>
<h2 id="成员函数"><a href="#成员函数" class="headerlink" title="成员函数"></a>成员函数</h2><p>不占用类实例的空间，编译器为每一个成员函数和类做对应工作。每个成员函数编译器都会为其分配一个对应的类类型对象this已经一个别名。同样，this指针也是通过偏移访问成员变量，在没有虚基类的情况下，如果编译器把this指针缓存到了寄存器中，访问成员变量的过程将与访问局部变量的开销相似。</p>
<p><img src="http://boombac-note-images.oss-cn-hangzhou.aliyuncs.com/img/image-20220208165934510.png" alt="image-20220208165934510"></p>
<p>成员函数也可以被覆盖，根据是否添加关键字<code>virtual</code>来区分编译时覆盖和运行时覆盖。</p>
<ul>
<li>编译期覆盖：调用根据左边的变量类型决定</li>
<li>运行时：只能有指针调用，根据实际类型来决定。</li>
</ul>
<p>为了实现这种机制，引入了隐藏的vfptr成员变量。一个vfptr被加入到类中（如果类中没有的话），该vfptr指向类的虚函数表（vftable）。类中每个虚函数在该类的虚函数表中都占据一项。每项保存一个对于该类适用的虚函数的地址。因此，调用虚函数的过程如下：取得实例的vfptr；通过vfptr得到虚函数表的一项；通过虚函数表该项的函数地址间接调用虚函数。也就是说，在普通函数调用的参数传递、调用、返回指令开销外，虚函数调用还需要额外的开销。在一种实现中，<strong>一个体系内的类只会拥有一个vfptr</strong>，其从基类继承。当派生类添加新的虚函数时，只在原有的表中增添新项。</p>
<p>虚函数在构造函数调用时绑定，<strong>构造函数</strong>将vptr指向对应的vtab，所以不要再构造函数中调用虚函数，会出现问题。</p>
<p><img src="http://boombac-note-images.oss-cn-hangzhou.aliyuncs.com/img/image-20220208174920710.png" alt="image-20220208174920710"></p>
<p>结果是输出两次“I really am Erdos”。</p>
<ul>
<li>第一次是创建Erdos对象时调用构造，设置虚表，调用函数，没有问题。</li>
<li>第二次出现问题：创建Fermat对象时，要先调用Erdos的构造函数，又因为虚表在构造函数调用时绑定，所以在Fermat中写的虚函数并不会被调用。</li>
</ul>
<h3 id="单继承-1"><a href="#单继承-1" class="headerlink" title="单继承"></a>单继承</h3><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">Test</span></span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="type">int</span> Test_a_;</span><br><span class="line">    <span class="type">char</span> Test_c_;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">func</span><span class="params">()</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">Unit1</span> : <span class="keyword">public</span> Test</span><br><span class="line">&#123;</span><br><span class="line"><span class="keyword">public</span>:</span><br><span class="line">    <span class="type">int</span> Unit1_a_;</span><br><span class="line">    <span class="type">char</span> Unit1_c_;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">func</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">funcUnit</span><span class="params">()</span></span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<figure class="highlight plaintext"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br></pre></td><td class="code"><pre><span class="line">1&gt;class Unit1	size(24):</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt; 0	| +--- (base class Test)</span><br><span class="line">1&gt; 0	| | &#123;vfptr&#125;</span><br><span class="line">1&gt; 8	| | Test_a_</span><br><span class="line">1&gt;12	| | Test_c_</span><br><span class="line">1&gt;  	| | &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;	| +---</span><br><span class="line">1&gt;16	| Unit1_a_</span><br><span class="line">1&gt;20	| Unit1_c_</span><br><span class="line">1&gt;  	| &lt;alignment member&gt; (size=3)</span><br><span class="line">1&gt;	+---</span><br><span class="line">1&gt;Unit1::$vftable@:</span><br><span class="line">1&gt;	| &amp;Unit1_meta</span><br><span class="line">1&gt;	|  0</span><br><span class="line">1&gt; 0	| &amp;Unit1::func</span><br><span class="line">1&gt; 1	| &amp;Unit1::funcUnit</span><br><span class="line">1&gt;Unit1::func this adjustor: 0</span><br><span class="line">1&gt;Unit1::funcUnit this adjustor: 0</span><br></pre></td></tr></table></figure>

<p>子类没有新创建虚表，而是沿用父类，添加表项</p>
<h3 id="多继承-1"><a href="#多继承-1" class="headerlink" title="多继承"></a>多继承</h3><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedA</span> <span class="comment">//: virtual public Base</span></span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_A_;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">AVF</span><span class="params">()</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedB</span> <span class="comment">//: virtual public Base</span></span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_B_;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">BVF</span><span class="params">()</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"><span class="keyword">class</span> <span class="title class_">DerivedC</span> : <span class="keyword">public</span> DerivedA, <span class="keyword">public</span> DerivedB</span><br><span class="line">&#123;</span><br><span class="line">    <span class="type">int</span> derived_C_;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">AVF</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;;</span><br><span class="line">    <span class="function"><span class="keyword">virtual</span> <span class="type">void</span> <span class="title">BVF</span><span class="params">()</span> <span class="keyword">override</span> </span>&#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

